Repository: Platypus-Tech/platypus-os-original-drafts
Catalog: command lines/platypusPrompt/tools/hacking/netcat/po/*.po
Languages: sk

source: Listening on %s
sk: Po��vam na %s

source: Listening on %s (using %d sockets)
sk: Po��vam na %s (pou��vam %d socketov)

source: Received packet from %s:%d -> %s:%d (local)
sk: Prijat� paket z %s:%d -> %s:%d (lok�lne)

source: Received packet from %s:%d
sk: Prijat� paket z %s:%d

source: %s open
sk: %s otvoren�

source: Unwanted connection from %s:%hu (refused)
sk: Ne�iad�ce spojenie z %s:%hu (odmietnut�)

source: Connection from %s:%hu
sk: Spojenie z %s:%hu

source: Error:
sk: Chyba:

source: Warning:
sk: Varovanie:

source: Total received bytes: %s Total sent bytes: %s
sk: Celkove prijat�ch bajtov: %s Celkove poslan�ch bajtov: %s

source: Cmd line:
sk: Pr�kazov� riadok:

source: GNU netcat %s, a rewrite of the famous networking tool.
sk: GNU netcat %s, prep�san� verzia popul�rneho sie�ov�ho n�stroja.

source: Basic usages:
sk: Z�kladne pou�itie:

source: connect to somewhere: %s [options] hostname port [port] ...
sk: pripoji� sa niekam: %s [vo�by] hostname port [port] ...

source: listen for inbound: %s -l -p port [options] [hostname] [port] ...
sk: o�ak�va� spojenie: %s -l -p port [vo�by] [hostname] [port] ...

source: tunnel to somewhere: %s -L hostname:port -p port [options]
sk: vytvori� tunel niekam: %s -L hostname:port -p port [vo�by]

source: Mandatory arguments to long options are mandatory for short options too.
sk: Povinn� parametre pre dlh� vo�by s� povinn� i pre kr�tke vo�by.

source: -t, --tcp TCP mode (default) -T, --telnet answer using TELNET negotiation
sk: -t, --tcp TCP m�d (v�chodzie) -T, --telnet odpoveda� s pou�it�m TELNET negotiation

source: --tcp TCP mode (default) -t, --telnet answer using TELNET negotiation -T same as --telnet (compat)
sk: --tcp TCP m�d (v�chodzie) -t, --telnet odpoveda� s pou�it�m TELNET negotiation -T rovnak� ako --telnet (kompatibilita)

source: -u, --udp UDP mode -v, --verbose verbose (use twice to be more verbose) -V, --version output version information and exit -x, --hexdump hexdump incoming and outgoing traffic -w, --wait=SECS timeout for connects and final net reads -z, --zero zero-I/O mode (used for scanning)
sk: -u, --udp UDP m�d -v, --verbose ukecan� (dva kr�t pre va�iu ukecanos�) -V, --version vyp�sa� verziu a ukon�i� sa -x, --hexdump vyp�sa� pr�chodzie a odchodzie spojenia v hex -w, --wait=SECS vy�k�vacia doba pre spojenia a ��tanie zo siete -z, --zero nulov�-I/O m�d (pou��va sa pri skenovan�)

source: Remote port number can also be specified as range. Example: '1-1024'
sk: ��slo vzdialen�ho portu m��e by� definovan� i ako rozsah. Pr�klad: '1-1024'

source: Copyright (C) 2002 - 2003 Giovanni Giacobbi This program comes with NO WARRANTY, to the extent permitted by law. You may redistribute copies of this program under the terms of the GNU General Public License. For more information about these matters, see the file named COPYING. Original idea and design by Avian Research <hobbit@avian.org>, Written by Giovanni Giacobbi <giovanni@giacobbi.net>.
sk: Copyright (C) 2002 - 2003 Giovanni Giacobbi Tento program je ��ren� BEZ AK�CHKO�VEK Z�RUK, v rozsahu umo�nenom z�konom. K�pie tohto programu je mo�n� �alej ��ri� pod podmienkami GNU General Public License. Pre detailnej�ie inform�cie, vi� s�bor nazvan� COPYING. P�vodn� idea a dizajn Avian Research <hobbit@avian.org>, Nap�sal Giovanni Giacobbi <giovanni@giacobbi.net>.

source: Terminated.
sk: Ukon�en�.

source: Exiting.
sk: Ukon�ujem.

source: Couldn't execute %s: %s
sk: Nie je mo�n� spusti� %s: %s

source: Cannot specify `-e' option double
sk: Nie je mo�n� viackr�t zvoli� '-e' parameter

source: Invalid interval time "%s"
sk: Chybn� �as intervalu "%s"

source: `-L' and `-z' options are incompatible
sk: Vo�by `-L' a `-z' nie s� navz�jom kompatibiln�

source: Invalid target string for `-L' option
sk: Neplatn� cie�ov� re�azec pre `-L' vo�bu

source: Couldn't resolve tunnel target host: %s
sk: Nebolo mo�n� n�js� DNS z�znam pre cie�ov� host tunela: %s

source: Invalid tunnel target port: %s
sk: Neplatn� port pre cie�ov� host tunela: %s

source: Invalid local port: %s
sk: Neplatn� lok�lny port: %s

source: Invalid tunnel connect port: %s
sk: Neplatn� port pre lok�lnu stranu tunela: %s

source: Couldn't resolve local host: %s
sk: Nebolo mo�n� n�js� DNS z�znam pre lok�lny host: %s

source: Couldn't resolve tunnel local host: %s
sk: Nebolo mo�n� n�js� DNS z�znam pre lok�lnu stranu tunela: %s

source: Invalid wait-time: %s
sk: Neplatn� vy�k�vacia doba: %s

source: Try `%s --help' for more information.
sk: Sk�ste `%s --help' pre viac inform�ci�.

source: Randomization support not compiled, option `-r' discarded.
sk: Podpora generovania n�hodnosti nie je zakompilovan�, vo�ba `-r' vypusten�.

source: Failed to open output file: %s
sk: Nepodarilo sa otvori� s�bor: %s

source: Couldn't resolve host "%s"
sk: Nebolo mo�n� n�js� DNS z�znam pre "%s"

source: Invalid port specification: %s
sk: Neplatn� �pecifik�cia portu: %s

source: Listen mode failed: %s
sk: Po��vac� m�d zlyhal: %s

source: Passing control to the specified program
sk: Prenech�vam kontrolu �pecifikovan�mu programu

source: %s: missing hostname argument
sk: %s: ch�baj�ci parameter `hostname'

source: No ports specified for connection
sk: Pre spojenie neboli �pecifikovan� �iadne porty

source: This host's reverse DNS doesn't match! %s -- %s
sk: Reverzn� DNS z�znam pre host sa nezhoduje! %s -- %s

source: Host %s isn't authoritative! (direct lookup failed)
sk: Host %s nie je autoritat�vny! (priame vyh�adanie zlyhalo)

source: Host %s isn't authoritative! (direct lookup mismatch)
sk: Host %s nie je autoritat�vny! (priame vyh�adanie sa nezhoduje)

source: %s -> %s BUT %s -> %s
sk: %s -> %s ALE %s -> %s

source: any address
sk: akejko�vek adrese
